src/Lab.org
#+title: 学校作业记录
* 综合课程设计题目
** 10.1.1 线性表
这次实践选了三个简单的A级题目，要是没把以前的仓库删了，C级题目就能写了
*** A1 Josephus 环问题 
**** 题目描述
判决 =length= 个犯人的死刑，让犯人站成一个圈，从 =start= 开始暑期，每数到 =distance= 个犯人，就拉出来处决
然后再从下一个开始数 =distance= 个，数到的人再处决，知道剩下最后一个犯人予以赦免
**** 分析
1. =josephus= 环的问题我用循环链表来解决，由于标准库里没有这个数据结构，这里我手动调整下迭代器的位置就够了
2. 这个程序有终止条件，当 *犯人数量* 为 1 时停止
**** 函数说明
=int josephus(int length, int start, int distance)=
- 传入犯人的数量 =length= ，从第 =start= 开始，间隔为 =distance=
- 数到第 =distance= 个犯人时,将当前迭代器删除
- 函数返回存活的犯人编号
**** 完整代码
#+begin_src c++
  int josephus(int length, int start, int distance) {
    list<int> prisoners;

    for (int i = 1; i <= length; i += 1) {
      prisoners.push_back(i);
    }

    list<int>::iterator it = next(prisoners.begin(), start - 1);
    while (true) {
      if (prisoners.size() == 1) {
        break;
      }

      // list<int>::iterator target = next(it, distance - 1);
      list<int>::iterator target = it;
      for (int i = 2; i <= distance; i += 1) {
        target = next(target);
        if (target == prisoners.end()) {
          target = prisoners.begin();
        }
      }

      it = next(target);
      prisoners.erase(target);

      if (it == prisoners.end()) {
        it = prisoners.begin();
      }
    }

    return prisoners.front());
  }

#+end_src

