html/Lab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-17 三 07:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>学校作业记录</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Steiner" />
<link rel="stylesheet" type="text/css" href="css/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">学校作业记录</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgca434c9">综合课程设计题目</a>
<ul>
<li><a href="#org32c2faa">10.1.1 线性表</a>
<ul>
<li><a href="#orgb888110">A1 Josephus 环问题</a>
<ul>
<li><a href="#orgccfcd80">题目描述</a></li>
<li><a href="#orgb11f20a">分析</a></li>
<li><a href="#orgd67a67b">函数说明</a></li>
<li><a href="#orga635802">完整代码</a></li>
<li><a href="#org8617828">测试案例</a></li>
<li><a href="#org4f03c2d">时间复杂度</a></li>
</ul>
</li>
<li><a href="#org0fcb08d">A2 合并线性表</a>
<ul>
<li><a href="#orge6ee6a7">题目描述</a></li>
<li><a href="#org44bf6f6">分析</a></li>
<li><a href="#orgef58a27">函数说明</a></li>
<li><a href="#orga7afed5">完整代码</a></li>
<li><a href="#orgf0d0f12">测试案例</a></li>
<li><a href="#org36a9388">时间复杂度</a></li>
</ul>
</li>
<li><a href="#org239e938">A3 合并两个有序链表</a>
<ul>
<li><a href="#org4fe437d">问题描述</a></li>
<li><a href="#org6316dd5">分析</a></li>
<li><a href="#orgd3f18b5">函数说明</a></li>
<li><a href="#org6001d16">完整代码</a></li>
<li><a href="#org2b0be28">测试案例</a></li>
<li><a href="#org2ee7145">时间复杂度</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7a91fe2">10.1.2 栈与队列</a>
<ul>
<li><a href="#org9cc4c91">A1 数制转换问题</a>
<ul>
<li><a href="#org1e7ac48">题目描述</a></li>
<li><a href="#org9b8b77a">题目分析</a>
<ul>
<li><a href="#org69bcfc8">定义函数</a></li>
<li><a href="#org7ad2022">测试案例</a></li>
</ul>
</li>
<li><a href="#org7dc56f3">完整代码</a></li>
<li><a href="#org19f6ca1">测试案例</a></li>
</ul>
</li>
<li><a href="#org9dd344e">A2 回文判断</a>
<ul>
<li><a href="#org85484cd">题目描述</a></li>
<li><a href="#orgf69b62a">题目分析</a>
<ul>
<li><a href="#org41a06f1">函数定义</a></li>
<li><a href="#orgc6843ca">测试案例</a></li>
</ul>
</li>
<li><a href="#org879a623">完整代码</a></li>
<li><a href="#orgbce9028">测试案例</a></li>
</ul>
</li>
<li><a href="#orge4a1fff">A4 破解藏头诗</a>
<ul>
<li><a href="#org9752afd">题目描述</a></li>
<li><a href="#org34576dd">题目分析</a>
<ul>
<li><a href="#orgdee93da">函数定义</a></li>
<li><a href="#org3b2f8d0">测试案例</a></li>
</ul>
</li>
<li><a href="#orgc318596">完整代码</a></li>
<li><a href="#org17150ee">测试案例</a></li>
</ul>
</li>
<li><a href="#org3b47752">A5 括号匹配的检验</a>
<ul>
<li><a href="#orgec39167">题目描述</a></li>
<li><a href="#org9ca52b9">题目分析</a>
<ul>
<li><a href="#orgf0c8e05">函数定义</a></li>
<li><a href="#org6f780d7">测试案例</a></li>
</ul>
</li>
<li><a href="#org5e5e510">完整代码</a></li>
<li><a href="#orga4534bc">测试案例</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6283224">10.1.3 二叉树与树</a>
<ul>
<li><a href="#org978bfb3">1. 二叉树各节点数值的平均值</a>
<ul>
<li><a href="#org50ccefc">函数说明</a></li>
<li><a href="#org8ef4dfd">测试案例</a></li>
<li><a href="#orgb16593d">完整代码</a></li>
</ul>
</li>
<li><a href="#org67262e7">2. 交换每个节点的左右节点</a>
<ul>
<li><a href="#org3025619">函数说明</a></li>
<li><a href="#org64d4421">测试案例</a></li>
<li><a href="#orgf1580ff">完整代码</a></li>
</ul>
</li>
<li><a href="#org150b25a">3. 验证 二叉树性质3</a>
<ul>
<li><a href="#orgd98e4d8">函数说明</a></li>
<li><a href="#orgcb09441">测试案例</a></li>
<li><a href="#org8586006">完整代码</a></li>
</ul>
</li>
<li><a href="#org1c256ac">4. 中序遍历，后序遍历</a>
<ul>
<li><a href="#org3347c28">函数说明</a></li>
<li><a href="#orgd533cd5">测试案例</a></li>
<li><a href="#org2116610">完整代码</a></li>
</ul>
</li>
<li><a href="#org6ad3a3b">5. 判断两个二叉树相等</a>
<ul>
<li><a href="#org97bee96">函数说明</a></li>
<li><a href="#org3de0947">测试案例</a></li>
<li><a href="#orgaa94a31">完整代码</a></li>
</ul>
</li>
<li><a href="#orge1ba239">6. 判断 是否完全二叉树</a>
<ul>
<li><a href="#org91df1aa">函数说明</a></li>
<li><a href="#org9cd9274">测试案例</a></li>
<li><a href="#orgfe501b4">完整代码</a></li>
</ul>
</li>
<li><a href="#org3ba80da">7. 后序遍历中第一个返回的节点</a>
<ul>
<li><a href="#orgffec193">函数说明</a></li>
<li><a href="#org454992c">测试案例</a></li>
<li><a href="#org240059e">完整代码</a></li>
</ul>
</li>
<li><a href="#orgce343a5">8. 非递归实现 先序遍历，中序遍历，后序遍历</a>
<ul>
<li><a href="#orgd384a69">函数说明</a></li>
<li><a href="#orge5bb031">测试案例</a></li>
<li><a href="#org834dcbd">完整代码</a></li>
</ul>
</li>
<li><a href="#orga6435db">9. 查看节点所在层次</a>
<ul>
<li><a href="#orgc58fb5d">函数说明</a></li>
<li><a href="#org7675ab6">测试案例</a></li>
<li><a href="#orga87eebe">完整代码</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgca434c9" class="outline-2">
<h2 id="orgca434c9">综合课程设计题目</h2>
<div class="outline-text-2" id="text-orgca434c9">
</div>
<div id="outline-container-org32c2faa" class="outline-3">
<h3 id="org32c2faa">10.1.1 线性表</h3>
<div class="outline-text-3" id="text-org32c2faa">
<p>
这次实践选了三个简单的A级题目，要是没把以前的仓库删了，C级题目就能写了<br />
</p>
</div>
<div id="outline-container-orgb888110" class="outline-4">
<h4 id="orgb888110">A1 Josephus 环问题</h4>
<div class="outline-text-4" id="text-orgb888110">
</div>
<div id="outline-container-orgccfcd80" class="outline-5">
<h5 id="orgccfcd80">题目描述</h5>
<div class="outline-text-5" id="text-orgccfcd80">
<p>
判决 <code>length</code> 个犯人的死刑，让犯人站成一个圈，从 <code>start</code> 开始暑期，每数到 <code>distance</code> 个犯人，就拉出来处决<br />
然后再从下一个开始数 <code>distance</code> 个，数到的人再处决，知道剩下最后一个犯人予以赦免<br />
</p>
</div>
</div>
<div id="outline-container-orgb11f20a" class="outline-5">
<h5 id="orgb11f20a">分析</h5>
<div class="outline-text-5" id="text-orgb11f20a">
<ol class="org-ol">
<li><code>josephus</code> 环的问题我用循环链表来解决，由于标准库里没有这个数据结构，这里我手动调整下迭代器的位置就够了<br /></li>
<li>这个程序有终止条件，当 <b>犯人数量</b> 为 1 时停止<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgd67a67b" class="outline-5">
<h5 id="orgd67a67b">函数说明</h5>
<div class="outline-text-5" id="text-orgd67a67b">
<p>
<code>int josephus(int length, int start, int distance)</code><br />
</p>
<ul class="org-ul">
<li>传入犯人的数量 <code>length</code> ，从第 <code>start</code> 开始，间隔为 <code>distance</code><br /></li>
<li>数到第 <code>distance</code> 个犯人时,将当前迭代器删除<br /></li>
<li>函数返回存活的犯人编号<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orga635802" class="outline-5">
<h5 id="orga635802">完整代码</h5>
<div class="outline-text-5" id="text-orga635802">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #986801;">int</span> <span style="color: #a626a4;">josephus</span><span style="color: #4078f2;">(</span><span style="color: #986801;">int</span> <span style="color: #6a1868;">length</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">start</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">distance</span><span style="color: #4078f2;">)</span> <span style="color: #4078f2;">{</span>
  <span style="color: #986801;">list</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> <span style="color: #6a1868;">prisoners</span>;

  <span style="color: #e45649; font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="color: #986801;">int</span> <span style="color: #6a1868;">i</span> = 1; i &lt;= length; i += 1<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    prisoners.push_back<span style="color: #50a14f;">(</span>i<span style="color: #50a14f;">)</span>;
  <span style="color: #a626a4;">}</span>

  <span style="color: #b751b6;">list</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span>::<span style="color: #986801;">iterator</span> <span style="color: #6a1868;">it</span> = next<span style="color: #a626a4;">(</span>prisoners.begin<span style="color: #50a14f;">()</span>, start - 1<span style="color: #a626a4;">)</span>;
  <span style="color: #e45649; font-weight: bold;">while</span> <span style="color: #a626a4;">(</span><span style="color: #b751b6;">true</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="color: #e45649; font-weight: bold;">if</span> <span style="color: #50a14f;">(</span>prisoners.size<span style="color: #b751b6;">()</span> == 1<span style="color: #50a14f;">)</span> <span style="color: #50a14f;">{</span>
      <span style="color: #e45649; font-weight: bold;">break</span>;
    <span style="color: #50a14f;">}</span>

    <span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">list&lt;int&gt;::iterator target = next(it, distance - 1);</span>
    <span style="color: #b751b6;">list</span><span style="color: #50a14f;">&lt;</span><span style="color: #986801;">int</span><span style="color: #50a14f;">&gt;</span>::<span style="color: #986801;">iterator</span> <span style="color: #6a1868;">target</span> = it;
    <span style="color: #e45649; font-weight: bold;">for</span> <span style="color: #50a14f;">(</span><span style="color: #986801;">int</span> <span style="color: #6a1868;">i</span> = 2; i &lt;= distance; i += 1<span style="color: #50a14f;">)</span> <span style="color: #50a14f;">{</span>
      target = next<span style="color: #b751b6;">(</span>target<span style="color: #b751b6;">)</span>;
      <span style="color: #e45649; font-weight: bold;">if</span> <span style="color: #b751b6;">(</span>target == prisoners.end<span style="color: #4db5bd;">()</span><span style="color: #b751b6;">)</span> <span style="color: #b751b6;">{</span>
        target = prisoners.begin<span style="color: #4db5bd;">()</span>;
      <span style="color: #b751b6;">}</span>
    <span style="color: #50a14f;">}</span>

    it = next<span style="color: #50a14f;">(</span>target<span style="color: #50a14f;">)</span>;
    prisoners.erase<span style="color: #50a14f;">(</span>target<span style="color: #50a14f;">)</span>;

    <span style="color: #e45649; font-weight: bold;">if</span> <span style="color: #50a14f;">(</span>it == prisoners.end<span style="color: #b751b6;">()</span><span style="color: #50a14f;">)</span> <span style="color: #50a14f;">{</span>
      it = prisoners.begin<span style="color: #b751b6;">()</span>;
    <span style="color: #50a14f;">}</span>
  <span style="color: #a626a4;">}</span>

  <span style="color: #e45649; font-weight: bold;">return</span> prisoners.front<span style="color: #a626a4;">()</span><span style="color: #e45649; font-weight: bold;">)</span>;
<span style="color: #e45649; font-weight: bold;">}</span>

</pre>
</div>
</div>
</div>
