src/Lab.org
**** 测试案例
- 测试代码
#+begin_src c++
  int main() {
    cout << "josephus(3, 2, 3)" << '\t' << josephus(3, 2, 3) << endl;
    cout << "josephus(4, 2, 3)" << '\t' << josephus(4, 2, 3) << endl;
    cout << "josephus(5, 2, 3)" << '\t' << josephus(5, 2, 3) << endl;
    cout << "josephus(6, 2, 3)" << '\t' << josephus(6, 2, 3) << endl;
    cout << "josephus(7, 2, 3)" << '\t' << josephus(7, 2, 3) << endl;
    cout << "josephus(8, 2, 3)" << '\t' << josephus(8, 2, 3) << endl;
    cout << "josephus(9, 2, 3)" << '\t' << josephus(9, 2, 3) << endl;
    cout << "josephus(10, 2, 3)" << '\t' << josephus(10, 2, 3) << endl;

    return 0;
  }

#+end_src

- 运行结果
#+begin_src c++
  josephus(3, 2, 3)	3
  josephus(4, 2, 3)	2
  josephus(5, 2, 3)	5
  josephus(6, 2, 3)	2
  josephus(7, 2, 3)	5
  josephus(8, 2, 3)	8
  josephus(9, 2, 3)	2
  josephus(10, 2, 3)	5

#+end_src
**** 时间复杂度
=O(n)=

*** A2 合并线性表
**** 题目描述
求两个集合的 =union= 操作，分别用顺序存储结构和链式存储结构实现
**** 分析
1. 有两个链表 =A= , =B=
2. 创建链表 =C= 为 =A= 的备份，再从 =B= 中提取不属于 =A= 的元素， 然后插入到 =C=
**** 函数说明
1. =list<int> union_list(list<int> & left, list<int> & right)=
   - 传入链表 =left= 与 =right=
   - 返回一个链表

2. =vector<int> union_vector(vector<int> & left, vector<int> & right)=
   - 传入数组 =left= 与 =right=
   - 返回一个数组
**** 完整代码
- 首先是合并链表
#+begin_src c++
  list<int> union_list(list<int> & left, list<int> & right) {
    list<int> result = left;
    for (int value : right) {
      auto it = find(result.begin(), result.end(), value);
      if (it == result.end()) {
        result.push_back(value);
      }
    }

    return result;
  }

#+end_src

- 接下来合并数组是类似的
#+begin_src c++
  vector<int> union_vector(vector<int> & left, vector<int> & right) {
    vector<int> result = left;
    for (int value : right) {
      auto it = find(result.begin(), result.end(), value);
      if (it == result.end()) {
        result.push_back(value);
      }
    }

    return result;
  }
#+end_src
**** 测试案例
- 测试代码
#+begin_src c++
  int main() {
    vector<int> nums = {16, 2, 27, 29};
    vector<int> left = nums;
    vector<int> right = nums;

    for(int value: union_vector(left, right)) {
      cout << value << endl;
    }
    return 0;
  }

#+end_src

- 运行结果
#+begin_src sh
  16
  2
  27
  29
#+end_src
**** 时间复杂度
设链表 =left= 的长度为 =M=
设链表 =right= 的长度为 =N=
时间复杂度为 =O(M*N)=
*** A3 合并两个有序链表
**** 问题描述
=left= 和 =right= 是两个有序表，将他们合并成一个有序表
**** 分析
1. 这个程序要参考归并排序，还是很简单的
2. 这里链表和数组的访问操作有些不同，需要注意
3. 链表的访问需要使用迭代器，需要对迭代器调用 =next= 跳转到下一个位置
4. 数组的访问可以通过索引，能够实现随机访问
5. *这里我一个手滑把归并写出来了，应该没事*
