html/Lab.html

<div id="outline-container-org8617828" class="outline-5">
<h5 id="org8617828">测试案例</h5>
<div class="outline-text-5" id="text-org8617828">
<ul class="org-ul">
<li>测试代码<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #986801;">int</span> <span style="color: #a626a4;">main</span><span style="color: #4078f2;">()</span> <span style="color: #4078f2;">{</span>
  cout &lt;&lt; <span style="color: #50a14f;">"josephus(3, 2, 3)"</span> &lt;&lt; <span style="color: #50a14f;">'\t'</span> &lt;&lt; josephus<span style="color: #a626a4;">(</span>3, 2, 3<span style="color: #a626a4;">)</span> &lt;&lt; endl;
  cout &lt;&lt; <span style="color: #50a14f;">"josephus(4, 2, 3)"</span> &lt;&lt; <span style="color: #50a14f;">'\t'</span> &lt;&lt; josephus<span style="color: #a626a4;">(</span>4, 2, 3<span style="color: #a626a4;">)</span> &lt;&lt; endl;
  cout &lt;&lt; <span style="color: #50a14f;">"josephus(5, 2, 3)"</span> &lt;&lt; <span style="color: #50a14f;">'\t'</span> &lt;&lt; josephus<span style="color: #a626a4;">(</span>5, 2, 3<span style="color: #a626a4;">)</span> &lt;&lt; endl;
  cout &lt;&lt; <span style="color: #50a14f;">"josephus(6, 2, 3)"</span> &lt;&lt; <span style="color: #50a14f;">'\t'</span> &lt;&lt; josephus<span style="color: #a626a4;">(</span>6, 2, 3<span style="color: #a626a4;">)</span> &lt;&lt; endl;
  cout &lt;&lt; <span style="color: #50a14f;">"josephus(7, 2, 3)"</span> &lt;&lt; <span style="color: #50a14f;">'\t'</span> &lt;&lt; josephus<span style="color: #a626a4;">(</span>7, 2, 3<span style="color: #a626a4;">)</span> &lt;&lt; endl;
  cout &lt;&lt; <span style="color: #50a14f;">"josephus(8, 2, 3)"</span> &lt;&lt; <span style="color: #50a14f;">'\t'</span> &lt;&lt; josephus<span style="color: #a626a4;">(</span>8, 2, 3<span style="color: #a626a4;">)</span> &lt;&lt; endl;
  cout &lt;&lt; <span style="color: #50a14f;">"josephus(9, 2, 3)"</span> &lt;&lt; <span style="color: #50a14f;">'\t'</span> &lt;&lt; josephus<span style="color: #a626a4;">(</span>9, 2, 3<span style="color: #a626a4;">)</span> &lt;&lt; endl;
  cout &lt;&lt; <span style="color: #50a14f;">"josephus(10, 2, 3)"</span> &lt;&lt; <span style="color: #50a14f;">'\t'</span> &lt;&lt; josephus<span style="color: #a626a4;">(</span>10, 2, 3<span style="color: #a626a4;">)</span> &lt;&lt; endl;

  <span style="color: #e45649; font-weight: bold;">return</span> 0;
<span style="color: #4078f2;">}</span>

</pre>
</div>

<ul class="org-ul">
<li>运行结果<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-c++">josephus<span style="color: #4078f2;">(</span>3, 2, 3<span style="color: #4078f2;">)</span>       3
josephus<span style="color: #4078f2;">(</span>4, 2, 3<span style="color: #4078f2;">)</span>       2
josephus<span style="color: #4078f2;">(</span>5, 2, 3<span style="color: #4078f2;">)</span>       5
josephus<span style="color: #4078f2;">(</span>6, 2, 3<span style="color: #4078f2;">)</span>       2
josephus<span style="color: #4078f2;">(</span>7, 2, 3<span style="color: #4078f2;">)</span>       5
josephus<span style="color: #4078f2;">(</span>8, 2, 3<span style="color: #4078f2;">)</span>       8
josephus<span style="color: #4078f2;">(</span>9, 2, 3<span style="color: #4078f2;">)</span>       2
josephus<span style="color: #4078f2;">(</span>10, 2, 3<span style="color: #4078f2;">)</span>      5

</pre>
</div>
</div>
</div>
<div id="outline-container-org4f03c2d" class="outline-5">
<h5 id="org4f03c2d">时间复杂度</h5>
<div class="outline-text-5" id="text-org4f03c2d">
<p>
<code>O(n)</code><br />
</p>
</div>
</div>
</div>

<div id="outline-container-org0fcb08d" class="outline-4">
<h4 id="org0fcb08d">A2 合并线性表</h4>
<div class="outline-text-4" id="text-org0fcb08d">
</div>
<div id="outline-container-orge6ee6a7" class="outline-5">
<h5 id="orge6ee6a7">题目描述</h5>
<div class="outline-text-5" id="text-orge6ee6a7">
<p>
求两个集合的 <code>union</code> 操作，分别用顺序存储结构和链式存储结构实现<br />
</p>
</div>
</div>
<div id="outline-container-org44bf6f6" class="outline-5">
<h5 id="org44bf6f6">分析</h5>
<div class="outline-text-5" id="text-org44bf6f6">
<ol class="org-ol">
<li>有两个链表 <code>A</code> , <code>B</code><br /></li>
<li>创建链表 <code>C</code> 为 <code>A</code> 的备份，再从 <code>B</code> 中提取不属于 <code>A</code> 的元素， 然后插入到 <code>C</code><br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgef58a27" class="outline-5">
<h5 id="orgef58a27">函数说明</h5>
<div class="outline-text-5" id="text-orgef58a27">
<ol class="org-ol">
<li><code>list&lt;int&gt; union_list(list&lt;int&gt; &amp; left, list&lt;int&gt; &amp; right)</code><br />
<ul class="org-ul">
<li>传入链表 <code>left</code> 与 <code>right</code><br /></li>
<li>返回一个链表<br /></li>
</ul></li>

<li><code>vector&lt;int&gt; union_vector(vector&lt;int&gt; &amp; left, vector&lt;int&gt; &amp; right)</code><br />
<ul class="org-ul">
<li>传入数组 <code>left</code> 与 <code>right</code><br /></li>
<li>返回一个数组<br /></li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orga7afed5" class="outline-5">
<h5 id="orga7afed5">完整代码</h5>
<div class="outline-text-5" id="text-orga7afed5">
<ul class="org-ul">
<li>首先是合并链表<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #986801;">list</span><span style="color: #4078f2;">&lt;</span><span style="color: #986801;">int</span><span style="color: #4078f2;">&gt;</span> <span style="color: #a626a4;">union_list</span><span style="color: #4078f2;">(</span><span style="color: #986801;">list</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> &amp; <span style="color: #6a1868;">left</span>, <span style="color: #986801;">list</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> &amp; <span style="color: #6a1868;">right</span><span style="color: #4078f2;">)</span> <span style="color: #4078f2;">{</span>
  <span style="color: #986801;">list</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> <span style="color: #6a1868;">result</span> = left;
  <span style="color: #e45649; font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="color: #986801;">int</span> <span style="color: #6a1868;">value</span> : right<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="color: #e45649; font-weight: bold;">auto</span> <span style="color: #6a1868;">it</span> = find<span style="color: #50a14f;">(</span>result.begin<span style="color: #b751b6;">()</span>, result.end<span style="color: #b751b6;">()</span>, value<span style="color: #50a14f;">)</span>;
    <span style="color: #e45649; font-weight: bold;">if</span> <span style="color: #50a14f;">(</span>it == result.end<span style="color: #b751b6;">()</span><span style="color: #50a14f;">)</span> <span style="color: #50a14f;">{</span>
      result.push_back<span style="color: #b751b6;">(</span>value<span style="color: #b751b6;">)</span>;
    <span style="color: #50a14f;">}</span>
  <span style="color: #a626a4;">}</span>

  <span style="color: #e45649; font-weight: bold;">return</span> result;
<span style="color: #4078f2;">}</span>

</pre>
</div>

<ul class="org-ul">
<li>接下来合并数组是类似的<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #986801;">vector</span><span style="color: #4078f2;">&lt;</span><span style="color: #986801;">int</span><span style="color: #4078f2;">&gt;</span> <span style="color: #a626a4;">union_vector</span><span style="color: #4078f2;">(</span><span style="color: #986801;">vector</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> &amp; <span style="color: #6a1868;">left</span>, <span style="color: #986801;">vector</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> &amp; <span style="color: #6a1868;">right</span><span style="color: #4078f2;">)</span> <span style="color: #4078f2;">{</span>
  <span style="color: #986801;">vector</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> <span style="color: #6a1868;">result</span> = left;
  <span style="color: #e45649; font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="color: #986801;">int</span> <span style="color: #6a1868;">value</span> : right<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="color: #e45649; font-weight: bold;">auto</span> <span style="color: #6a1868;">it</span> = find<span style="color: #50a14f;">(</span>result.begin<span style="color: #b751b6;">()</span>, result.end<span style="color: #b751b6;">()</span>, value<span style="color: #50a14f;">)</span>;
    <span style="color: #e45649; font-weight: bold;">if</span> <span style="color: #50a14f;">(</span>it == result.end<span style="color: #b751b6;">()</span><span style="color: #50a14f;">)</span> <span style="color: #50a14f;">{</span>
      result.push_back<span style="color: #b751b6;">(</span>value<span style="color: #b751b6;">)</span>;
    <span style="color: #50a14f;">}</span>
  <span style="color: #a626a4;">}</span>

  <span style="color: #e45649; font-weight: bold;">return</span> result;
<span style="color: #4078f2;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf0d0f12" class="outline-5">
<h5 id="orgf0d0f12">测试案例</h5>
<div class="outline-text-5" id="text-orgf0d0f12">
<ul class="org-ul">
<li>测试代码<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #986801;">int</span> <span style="color: #a626a4;">main</span><span style="color: #4078f2;">()</span> <span style="color: #4078f2;">{</span>
  <span style="color: #986801;">vector</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> <span style="color: #6a1868;">nums</span> = <span style="color: #a626a4;">{</span>16, 2, 27, 29<span style="color: #a626a4;">}</span>;
  <span style="color: #986801;">vector</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> <span style="color: #6a1868;">left</span> = nums;
  <span style="color: #986801;">vector</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> <span style="color: #6a1868;">right</span> = nums;

  <span style="color: #e45649; font-weight: bold;">for</span><span style="color: #a626a4;">(</span><span style="color: #986801;">int</span> <span style="color: #6a1868;">value</span>: union_vector<span style="color: #50a14f;">(</span>left, right<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    cout &lt;&lt; value &lt;&lt; endl;
  <span style="color: #a626a4;">}</span>
  <span style="color: #e45649; font-weight: bold;">return</span> 0;
<span style="color: #4078f2;">}</span>

</pre>
</div>

<ul class="org-ul">
<li>运行结果<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">16
2
27
29
</pre>
</div>
</div>
</div>
<div id="outline-container-org36a9388" class="outline-5">
<h5 id="org36a9388">时间复杂度</h5>
<div class="outline-text-5" id="text-org36a9388">
<p>
设链表 <code>left</code> 的长度为 <code>M</code><br />
设链表 <code>right</code> 的长度为 <code>N</code><br />
时间复杂度为 <code>O(M*N)</code><br />
</p>
</div>
</div>
</div>
<div id="outline-container-org239e938" class="outline-4">
<h4 id="org239e938">A3 合并两个有序链表</h4>
<div class="outline-text-4" id="text-org239e938">
</div>
<div id="outline-container-org4fe437d" class="outline-5">
<h5 id="org4fe437d">问题描述</h5>
<div class="outline-text-5" id="text-org4fe437d">
<p>
<code>left</code> 和 <code>right</code> 是两个有序表，将他们合并成一个有序表<br />
</p>
</div>
</div>
<div id="outline-container-org6316dd5" class="outline-5">
<h5 id="org6316dd5">分析</h5>
<div class="outline-text-5" id="text-org6316dd5">
<ol class="org-ol">
<li>这个程序要参考归并排序，还是很简单的<br /></li>
<li>这里链表和数组的访问操作有些不同，需要注意<br /></li>
<li>链表的访问需要使用迭代器，需要对迭代器调用 <code>next</code> 跳转到下一个位置<br /></li>
<li>数组的访问可以通过索引，能够实现随机访问<br /></li>
<li><b>这里我一个手滑把归并写出来了，应该没事</b><br /></li>
</ol>
</div>
</div>
