src/Lab.org
**** 函数说明
1. 首先是顶层函数 =merge_sort=
   =void merge_sort(list<int> &nums, compare comp = less)=
   #+begin_src c++
     void merge_sort(list<int> &nums, compare comp = less) {
       vector<int> temp(nums.size());
       int left = firstindex(nums);
       int right = lastindex(nums);

       _merge_sort(nums, left, right, temp, comp);
     }

   #+end_src
2. 顶级函数需要 =_merge_sort= 来帮助完成排序 
   =void _merge_sort(list<int> &nums, int left, int right, vector<int> &temp, compare comp)=
   #+begin_src c++
     void _merge_sort(list<int> &nums, int left, int right, vector<int> &temp,
                      compare comp) {
       if (left < right) {
         int middle = (left + right) / 2;
         _merge_sort(nums, left, middle, temp, comp);
         _merge_sort(nums, middle + 1, right, temp, comp);
         _merge_sorted(nums , left, middle, right, temp, comp);
       }
     }

   #+end_src
3. =_merge_sort= 需要 =_merge_sorted= 来帮助排序，这个才是最主要的
   =void _merge_sorted(list<int> &nums, int left, int middle, int right, vector<int> &temp, compare comp)=
   
**** 完整代码
#+begin_src c++
  void _merge_sorted(list<int> &nums, int left, int middle, int right,
                     vector<int> &temp, compare comp) {
    int _left = left;
    int _right = middle + 1;
    int index = 0;
    auto it = nums.begin();

    while (_left <= middle && _right <= right) {
      auto left_value = *(next(it, _left));
      auto right_value = *(next(it, _right));

      if (comp(left_value, right_value)) {
        temp[index] = left_value;
        index += 1;
        _left += 1;
      } else {
        temp[index] = right_value;
        index += 1;
        _right += 1;
      }
    }

    while (_left <= middle) {
      auto left_value = *(next(it, _left));
      temp[index] = left_value;
      index += 1;
      _left += 1;
    }

    while (_right <= right) {
      auto right_value = *(next(it, _right));
      temp[index] = right_value;
      index += 1;
      _right += 1;
    }

    index = 0;
    while (left <= right) {
      auto position = next(it, left);
      ,*(position) = temp[index];

      left += 1;
      index += 1;
    }
  }

#+end_src
还是别看代码了，写的有点乱，挑几个重要的说
1. 与数组的访问 =nums[index]= 不同，链表的访问需要先获取头节点的迭代器 =iter= ，然后调用 =next(iter, index)= 跳转到目标位置，最后解引用获取值
2. 与数组的修改 =nums[index] = 1= 不同，链表的修改可以通过 =*iter = value= 来实现，类似于修改指针指向的值
**** 测试案例
- 测试代码
#+begin_src c++
  int main() {
    list<int> nums = {3, 38, 44, 47, 15, 36, 26, 27, 2, 46, 4, 19, 50, 48, 2};
    merge_sort(nums);

    for(int num: nums) {
      cout << num << '\t';
    }

    cout << endl;
    return 0;
  }

#+end_src

- 运行结果
#+begin_src sh
  2	2	3	4	15	19	26	27	36	38	44	46	47	48	50	
#+end_src
**** 时间复杂度
- 当使用长度为 =n= 的数组时，时间复杂度为 =O(nlogn)=
- 当使用长度为 =n= 的链表时，时间复杂度为 =O(n^2logn)=

** 10.1.2 栈与队列
*** A1 数制转换问题
**** 题目描述
对于任意一个非负的十进制整数，打印出与其等值的八进制数
**** 题目分析
这里我懒得从键盘输入，直接输入数字，然后返回表示八进制的字符串

***** 定义函数
=transformBase(number::Int)=
- 输入一个整数
- 输出一个字符串，表示其八进制数
***** 测试案例
- =transformBase(1348) == "2504"=
- =transformBase(1234) == "2322"=
