html/Lab.html
<div id="outline-container-orgd3f18b5" class="outline-5">
<h5 id="orgd3f18b5">函数说明</h5>
<div class="outline-text-5" id="text-orgd3f18b5">
<ol class="org-ol">
<li><p>
首先是顶层函数 <code>merge_sort</code><br />
<code>void merge_sort(list&lt;int&gt; &amp;nums, compare comp = less)</code><br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #986801;">void</span> <span style="color: #a626a4;">merge_sort</span><span style="color: #4078f2;">(</span><span style="color: #986801;">list</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> &amp;<span style="color: #6a1868;">nums</span>, <span style="color: #986801;">compare</span> <span style="color: #6a1868;">comp</span> = less<span style="color: #4078f2;">)</span> <span style="color: #4078f2;">{</span>
  <span style="color: #986801;">vector</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> <span style="color: #6a1868;">temp</span><span style="color: #a626a4;">(</span>nums.size<span style="color: #50a14f;">()</span><span style="color: #a626a4;">)</span>;
  <span style="color: #986801;">int</span> <span style="color: #6a1868;">left</span> = firstindex<span style="color: #a626a4;">(</span>nums<span style="color: #a626a4;">)</span>;
  <span style="color: #986801;">int</span> <span style="color: #6a1868;">right</span> = lastindex<span style="color: #a626a4;">(</span>nums<span style="color: #a626a4;">)</span>;

  _merge_sort<span style="color: #a626a4;">(</span>nums, left, right, temp, comp<span style="color: #a626a4;">)</span>;
<span style="color: #4078f2;">}</span>

</pre>
</div></li>
<li><p>
顶级函数需要 <code>_merge_sort</code> 来帮助完成排序<br />
<code>void _merge_sort(list&lt;int&gt; &amp;nums, int left, int right, vector&lt;int&gt; &amp;temp, compare comp)</code><br />
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #986801;">void</span> <span style="color: #a626a4;">_merge_sort</span><span style="color: #4078f2;">(</span><span style="color: #986801;">list</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> &amp;<span style="color: #6a1868;">nums</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">left</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">right</span>, <span style="color: #986801;">vector</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> &amp;<span style="color: #6a1868;">temp</span>,
                 <span style="color: #986801;">compare</span> <span style="color: #6a1868;">comp</span><span style="color: #4078f2;">)</span> <span style="color: #4078f2;">{</span>
  <span style="color: #e45649; font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>left &lt; right<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="color: #986801;">int</span> <span style="color: #6a1868;">middle</span> = <span style="color: #50a14f;">(</span>left + right<span style="color: #50a14f;">)</span> / 2;
    _merge_sort<span style="color: #50a14f;">(</span>nums, left, middle, temp, comp<span style="color: #50a14f;">)</span>;
    _merge_sort<span style="color: #50a14f;">(</span>nums, middle + 1, right, temp, comp<span style="color: #50a14f;">)</span>;
    _merge_sorted<span style="color: #50a14f;">(</span>nums , left, middle, right, temp, comp<span style="color: #50a14f;">)</span>;
  <span style="color: #a626a4;">}</span>
<span style="color: #4078f2;">}</span>

</pre>
</div></li>
<li><code>_merge_sort</code> 需要 <code>_merge_sorted</code> 来帮助排序，这个才是最主要的<br />
<code>void _merge_sorted(list&lt;int&gt; &amp;nums, int left, int middle, int right, vector&lt;int&gt; &amp;temp, compare comp)</code><br /></li>
</ol>
</div>
</div>

<div id="outline-container-org6001d16" class="outline-5">
<h5 id="org6001d16">完整代码</h5>
<div class="outline-text-5" id="text-org6001d16">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #986801;">void</span> <span style="color: #a626a4;">_merge_sorted</span><span style="color: #4078f2;">(</span><span style="color: #986801;">list</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> &amp;<span style="color: #6a1868;">nums</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">left</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">middle</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">right</span>,
                   <span style="color: #986801;">vector</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> &amp;<span style="color: #6a1868;">temp</span>, <span style="color: #986801;">compare</span> <span style="color: #6a1868;">comp</span><span style="color: #4078f2;">)</span> <span style="color: #4078f2;">{</span>
  <span style="color: #986801;">int</span> <span style="color: #6a1868;">_left</span> = left;
  <span style="color: #986801;">int</span> <span style="color: #6a1868;">_right</span> = middle + 1;
  <span style="color: #986801;">int</span> <span style="color: #6a1868;">index</span> = 0;
  <span style="color: #e45649; font-weight: bold;">auto</span> <span style="color: #6a1868;">it</span> = nums.begin<span style="color: #a626a4;">()</span>;

  <span style="color: #e45649; font-weight: bold;">while</span> <span style="color: #a626a4;">(</span>_left &lt;= middle &amp;&amp; _right &lt;= right<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="color: #e45649; font-weight: bold;">auto</span> <span style="color: #6a1868;">left_value</span> = *<span style="color: #50a14f;">(</span>next<span style="color: #b751b6;">(</span>it, _left<span style="color: #b751b6;">)</span><span style="color: #50a14f;">)</span>;
    <span style="color: #e45649; font-weight: bold;">auto</span> <span style="color: #6a1868;">right_value</span> = *<span style="color: #50a14f;">(</span>next<span style="color: #b751b6;">(</span>it, _right<span style="color: #b751b6;">)</span><span style="color: #50a14f;">)</span>;

    <span style="color: #e45649; font-weight: bold;">if</span> <span style="color: #50a14f;">(</span>comp<span style="color: #b751b6;">(</span>left_value, right_value<span style="color: #b751b6;">)</span><span style="color: #50a14f;">)</span> <span style="color: #50a14f;">{</span>
      temp<span style="color: #b751b6;">[</span>index<span style="color: #b751b6;">]</span> = left_value;
      index += 1;
      _left += 1;
    <span style="color: #50a14f;">}</span> <span style="color: #e45649; font-weight: bold;">else</span> <span style="color: #50a14f;">{</span>
      temp<span style="color: #b751b6;">[</span>index<span style="color: #b751b6;">]</span> = right_value;
      index += 1;
      _right += 1;
    <span style="color: #50a14f;">}</span>
  <span style="color: #a626a4;">}</span>

  <span style="color: #e45649; font-weight: bold;">while</span> <span style="color: #a626a4;">(</span>_left &lt;= middle<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="color: #e45649; font-weight: bold;">auto</span> <span style="color: #6a1868;">left_value</span> = *<span style="color: #50a14f;">(</span>next<span style="color: #b751b6;">(</span>it, _left<span style="color: #b751b6;">)</span><span style="color: #50a14f;">)</span>;
    temp<span style="color: #50a14f;">[</span>index<span style="color: #50a14f;">]</span> = left_value;
    index += 1;
    _left += 1;
  <span style="color: #a626a4;">}</span>

  <span style="color: #e45649; font-weight: bold;">while</span> <span style="color: #a626a4;">(</span>_right &lt;= right<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="color: #e45649; font-weight: bold;">auto</span> <span style="color: #6a1868;">right_value</span> = *<span style="color: #50a14f;">(</span>next<span style="color: #b751b6;">(</span>it, _right<span style="color: #b751b6;">)</span><span style="color: #50a14f;">)</span>;
    temp<span style="color: #50a14f;">[</span>index<span style="color: #50a14f;">]</span> = right_value;
    index += 1;
    _right += 1;
  <span style="color: #a626a4;">}</span>

  index = 0;
  <span style="color: #e45649; font-weight: bold;">while</span> <span style="color: #a626a4;">(</span>left &lt;= right<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="color: #e45649; font-weight: bold;">auto</span> <span style="color: #6a1868;">position</span> = next<span style="color: #50a14f;">(</span>it, left<span style="color: #50a14f;">)</span>;
    *<span style="color: #50a14f;">(</span>position<span style="color: #50a14f;">)</span> = temp<span style="color: #50a14f;">[</span>index<span style="color: #50a14f;">]</span>;

    left += 1;
    index += 1;
  <span style="color: #a626a4;">}</span>
<span style="color: #4078f2;">}</span>

</pre>
</div>
<p>
还是别看代码了，写的有点乱，挑几个重要的说<br />
</p>
<ol class="org-ol">
<li>与数组的访问 <code>nums[index]</code> 不同，链表的访问需要先获取头节点的迭代器 <code>iter</code> ，然后调用 <code>next(iter, index)</code> 跳转到目标位置，最后解引用获取值<br /></li>
<li>与数组的修改 <code>nums[index] = 1</code> 不同，链表的修改可以通过 <code>*iter = value</code> 来实现，类似于修改指针指向的值<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org2b0be28" class="outline-5">
<h5 id="org2b0be28">测试案例</h5>
<div class="outline-text-5" id="text-org2b0be28">
<ul class="org-ul">
<li>测试代码<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #986801;">int</span> <span style="color: #a626a4;">main</span><span style="color: #4078f2;">()</span> <span style="color: #4078f2;">{</span>
  <span style="color: #986801;">list</span><span style="color: #a626a4;">&lt;</span><span style="color: #986801;">int</span><span style="color: #a626a4;">&gt;</span> <span style="color: #6a1868;">nums</span> = <span style="color: #a626a4;">{</span>3, 38, 44, 47, 15, 36, 26, 27, 2, 46, 4, 19, 50, 48, 2<span style="color: #a626a4;">}</span>;
  merge_sort<span style="color: #a626a4;">(</span>nums<span style="color: #a626a4;">)</span>;

  <span style="color: #e45649; font-weight: bold;">for</span><span style="color: #a626a4;">(</span><span style="color: #986801;">int</span> <span style="color: #6a1868;">num</span>: nums<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    cout &lt;&lt; num &lt;&lt; <span style="color: #50a14f;">'\t'</span>;
  <span style="color: #a626a4;">}</span>

  cout &lt;&lt; endl;
  <span style="color: #e45649; font-weight: bold;">return</span> 0;
<span style="color: #4078f2;">}</span>

</pre>
</div>

<ul class="org-ul">
<li>运行结果<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">2       2       3       4       15      19      26      27      36      38      44      46      47      48      50      
</pre>
</div>
</div>
</div>
<div id="outline-container-org2ee7145" class="outline-5">
<h5 id="org2ee7145">时间复杂度</h5>
<div class="outline-text-5" id="text-org2ee7145">
<ul class="org-ul">
<li>当使用长度为 <code>n</code> 的数组时，时间复杂度为 <code>O(nlogn)</code><br /></li>
<li>当使用长度为 <code>n</code> 的链表时，时间复杂度为 <code>O(n^2logn)</code><br /></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org7a91fe2" class="outline-3">
<h3 id="org7a91fe2">10.1.2 栈与队列</h3>
<div class="outline-text-3" id="text-org7a91fe2">
</div>
<div id="outline-container-org9cc4c91" class="outline-4">
<h4 id="org9cc4c91">A1 数制转换问题</h4>
<div class="outline-text-4" id="text-org9cc4c91">
</div>
<div id="outline-container-org1e7ac48" class="outline-5">
<h5 id="org1e7ac48">题目描述</h5>
<div class="outline-text-5" id="text-org1e7ac48">
<p>
对于任意一个非负的十进制整数，打印出与其等值的八进制数<br />
</p>
</div>
</div>
<div id="outline-container-org9b8b77a" class="outline-5">
<h5 id="org9b8b77a">题目分析</h5>
<div class="outline-text-5" id="text-org9b8b77a">
<p>
这里我懒得从键盘输入，直接输入数字，然后返回表示八进制的字符串<br />
</p>
</div>

<div id="outline-container-org69bcfc8" class="outline-6">
<h6 id="org69bcfc8">定义函数</h6>
<div class="outline-text-6" id="text-org69bcfc8">
<p>
<code>transformBase(number::Int)</code><br />
</p>
<ul class="org-ul">
<li>输入一个整数<br /></li>
<li>输出一个字符串，表示其八进制数<br /></li>
</ul>
</div>
</div>
