src/Lab.org
**** 完整代码
#+begin_src julia
  function transformBase(number::Int)
    base = 8
    stack = createStack(Int)

    N = number
    div_N = Int(floor(N / base))
    mod_N = N % base
    push!(stack, mod_N)
  
    while div_N != 0
      N = div_N
      div_N = Int(floor(N / base))
      mod_N = N % base
      push!(stack, mod_N)
    end

    return reduce(string, stack; init="")
  end
#+end_src

**** 测试案例
#+begin_src julia
  @test transformBase(1348) == "2504"
  @test transformBase(1234) == "2322"
#+end_src

*** A2 回文判断
**** 题目描述
判断一个字符串是否为回文串，即是否左右对称
**** 题目分析
这个好像反转一下，然后与原字符串中的字符逐个对比就好了
***** 函数定义
=isPalindromic(str::String)=
- 输入一个字符串
- 输出一个 =bool= 类型，判断字符串是否为回文
***** 测试案例
- =isPalindromic("helleh") == true=
**** 完整代码
这东西，一个函数式代码就搞定了
#+begin_src julia
  function isPalindromic(str::String)
    return map(==, str, reverse(str)) |>
      nums -> all(isequal(1), nums)
  end
#+end_src

我用 =Clojure= 再写一遍，更清晰一点
#+begin_src clojure
  (defn palindromic? [string]
    (every (fn [x] 
             (= x 1))
           (map = string (reverse string))))
#+end_src
**** 测试案例
#+begin_src julia
  @test isPalindromic("helleh") == true
#+end_src
*** A4 破解藏头诗
**** 题目描述
输入一首藏头诗，一共四句，每句一行
输出每句的第一个汉字连接在一起的字符串
**** 题目分析
这里需要队列吗，可能我的解决方式不一样吧，我还是不喜欢从终端输入字符串
同样也可以用函数式来写
***** 函数定义
=headPoem(sentences::Vararg{String})=
其中 =Vararg= 指的是可变参数，
***** 测试案例
#+begin_src julia
  headPoem("我",
           "最近",
           "爱上了",
           "你的闺密") == "我最爱你"

#+end_src
**** 完整代码
#+begin_src julia
  headPoem(sentences::Vararg{String}) =  map(first, sentences) |> chs -> reduce(string, chs; init="")
#+end_src

这里我用函数式的 =Clojure= 再写一遍吧
#+begin_src clojure
  (defn head-poem [& sentences]
    (reduce str "" 
            (map first sentences)))
#+end_src
**** 测试案例
#+begin_src julia
  @test headPoem("我",
                 "最近",
                 "爱上了",
                 "你的闺密") == "我最爱你"
#+end_src
*** A5 括号匹配的检验
**** 题目描述
输入圆括号和方括号的任意序列，输出 *匹配* 或 *此串括号匹配不合法*
**** 题目分析
这个其实挺简单
将左括号，左中括号一类的符号归为 *left* 类，将对应的符号归为 *right* 类
遍历每一个符号
- 每碰到 =left= 类符号，就把符号放到一个栈里
- 每碰到 =right= 类符号，取栈顶 =top=
  - 若 =right= 与 =top= 字符相对应，如 =(= 与 =)= ， =[= 与 =]= ，则出栈，进行下一次遍历
  - 若 =right= 与 =top= 字符不匹配，肯定不匹配，推出遍历
- 遍历结束后, *return* 栈是否为空栈
- 注意，遍历前先把第一个符号入栈，否则无法处理 ="]"= 这种开头是 *right* 类符号的情况    
***** 函数定义
=matchPatterns(code::String)=
- 输入字符串序列，只有圆括号和方括号
- 输出括号是否匹配
***** 测试案例
- =matchPatterns("([])()") == true=
- =matchPatterns("]") == false=
- =matchPatterns("]()") == false=
