html/Lab.html
<div id="outline-container-org7ad2022" class="outline-6">
<h6 id="org7ad2022">测试案例</h6>
<div class="outline-text-6" id="text-org7ad2022">
<ul class="org-ul">
<li><code>transformBase(1348) =</code> "2504"=<br /></li>
<li><code>transformBase(1234) =</code> "2322"=<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7dc56f3" class="outline-5">
<h5 id="org7dc56f3">完整代码</h5>
<div class="outline-text-5" id="text-org7dc56f3">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #e45649; font-weight: bold;">function</span> <span style="color: #a626a4;">transformBase</span><span style="color: #4078f2;">(</span>number<span style="color: #383a42; background-color: #fafafa;">::</span><span style="color: #986801;">Int</span><span style="color: #4078f2;">)</span>
  base = 8
  stack = createStack<span style="color: #4078f2;">(</span><span style="color: #986801;">Int</span><span style="color: #4078f2;">)</span>

  N = number
  div_N = <span style="color: #986801;">Int</span><span style="color: #4078f2;">(</span>floor<span style="color: #a626a4;">(</span>N / base<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
  mod_N = N % base
  push!<span style="color: #4078f2;">(</span>stack, mod_N<span style="color: #4078f2;">)</span>

  <span style="color: #e45649; font-weight: bold;">while</span> div_N != 0
    N = div_N
    div_N = <span style="color: #986801;">Int</span><span style="color: #4078f2;">(</span>floor<span style="color: #a626a4;">(</span>N / base<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
    mod_N = N % base
    push!<span style="color: #4078f2;">(</span>stack, mod_N<span style="color: #4078f2;">)</span>
  <span style="color: #e45649; font-weight: bold;">end</span>

  <span style="color: #e45649; font-weight: bold;">return</span> reduce<span style="color: #4078f2;">(</span>string, stack; init=<span style="color: #50a14f;">""</span><span style="color: #4078f2;">)</span>
<span style="color: #e45649; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org19f6ca1" class="outline-5">
<h5 id="org19f6ca1">测试案例</h5>
<div class="outline-text-5" id="text-org19f6ca1">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #4078f2; font-weight: bold;">@test</span> transformBase<span style="color: #4078f2;">(</span>1348<span style="color: #4078f2;">)</span> == <span style="color: #50a14f;">"2504"</span>
<span style="color: #4078f2; font-weight: bold;">@test</span> transformBase<span style="color: #4078f2;">(</span>1234<span style="color: #4078f2;">)</span> == <span style="color: #50a14f;">"2322"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9dd344e" class="outline-4">
<h4 id="org9dd344e">A2 回文判断</h4>
<div class="outline-text-4" id="text-org9dd344e">
</div>
<div id="outline-container-org85484cd" class="outline-5">
<h5 id="org85484cd">题目描述</h5>
<div class="outline-text-5" id="text-org85484cd">
<p>
判断一个字符串是否为回文串，即是否左右对称<br />
</p>
</div>
</div>
<div id="outline-container-orgf69b62a" class="outline-5">
<h5 id="orgf69b62a">题目分析</h5>
<div class="outline-text-5" id="text-orgf69b62a">
<p>
这个好像反转一下，然后与原字符串中的字符逐个对比就好了<br />
</p>
</div>
<div id="outline-container-org41a06f1" class="outline-6">
<h6 id="org41a06f1">函数定义</h6>
<div class="outline-text-6" id="text-org41a06f1">
<p>
<code>isPalindromic(str::String)</code><br />
</p>
<ul class="org-ul">
<li>输入一个字符串<br /></li>
<li>输出一个 <code>bool</code> 类型，判断字符串是否为回文<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgc6843ca" class="outline-6">
<h6 id="orgc6843ca">测试案例</h6>
<div class="outline-text-6" id="text-orgc6843ca">
<ul class="org-ul">
<li><code>isPalindromic("helleh") =</code> true=<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org879a623" class="outline-5">
<h5 id="org879a623">完整代码</h5>
<div class="outline-text-5" id="text-org879a623">
<p>
这东西，一个函数式代码就搞定了<br />
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #e45649; font-weight: bold;">function</span> <span style="color: #a626a4;">isPalindromic</span><span style="color: #4078f2;">(</span>str<span style="color: #383a42; background-color: #fafafa;">::</span><span style="color: #986801;">String</span><span style="color: #4078f2;">)</span>
  <span style="color: #e45649; font-weight: bold;">return</span> map<span style="color: #4078f2;">(</span>==, str, reverse<span style="color: #a626a4;">(</span>str<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span> |&gt;
    nums -&gt; all<span style="color: #4078f2;">(</span>isequal<span style="color: #a626a4;">(</span>1<span style="color: #a626a4;">)</span>, nums<span style="color: #4078f2;">)</span>
<span style="color: #e45649; font-weight: bold;">end</span>
</pre>
</div>

<p>
我用 <code>Clojure</code> 再写一遍，更清晰一点<br />
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #4078f2;">(</span><span style="color: #e45649; font-weight: bold;">defn</span> <span style="color: #a626a4;">palindromic?</span> <span style="color: #a626a4;">[</span>string<span style="color: #a626a4;">]</span>
  <span style="color: #a626a4;">(</span>every <span style="color: #50a14f;">(</span><span style="color: #e45649; font-weight: bold;">fn</span> <span style="color: #b751b6;">[</span>x<span style="color: #b751b6;">]</span> 
           <span style="color: #b751b6;">(</span>= x 1<span style="color: #b751b6;">)</span><span style="color: #50a14f;">)</span>
         <span style="color: #50a14f;">(</span>map = string <span style="color: #b751b6;">(</span>reverse string<span style="color: #b751b6;">)</span><span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbce9028" class="outline-5">
<h5 id="orgbce9028">测试案例</h5>
<div class="outline-text-5" id="text-orgbce9028">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #4078f2; font-weight: bold;">@test</span> isPalindromic<span style="color: #4078f2;">(</span><span style="color: #50a14f;">"helleh"</span><span style="color: #4078f2;">)</span> == <span style="color: #b751b6;">true</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge4a1fff" class="outline-4">
<h4 id="orge4a1fff">A4 破解藏头诗</h4>
<div class="outline-text-4" id="text-orge4a1fff">
</div>
<div id="outline-container-org9752afd" class="outline-5">
<h5 id="org9752afd">题目描述</h5>
<div class="outline-text-5" id="text-org9752afd">
<p>
输入一首藏头诗，一共四句，每句一行<br />
输出每句的第一个汉字连接在一起的字符串<br />
</p>
</div>
</div>
<div id="outline-container-org34576dd" class="outline-5">
<h5 id="org34576dd">题目分析</h5>
<div class="outline-text-5" id="text-org34576dd">
<p>
这里需要队列吗，可能我的解决方式不一样吧，我还是不喜欢从终端输入字符串<br />
同样也可以用函数式来写<br />
</p>
</div>
<div id="outline-container-orgdee93da" class="outline-6">
<h6 id="orgdee93da">函数定义</h6>
<div class="outline-text-6" id="text-orgdee93da">
<p>
<code>headPoem(sentences::Vararg{String})</code><br />
其中 <code>Vararg</code> 指的是可变参数，<br />
</p>
</div>
</div>
<div id="outline-container-org3b2f8d0" class="outline-6">
<h6 id="org3b2f8d0">测试案例</h6>
<div class="outline-text-6" id="text-org3b2f8d0">
<div class="org-src-container">
<pre class="src src-julia">headPoem<span style="color: #4078f2;">(</span><span style="color: #50a14f;">"&#25105;"</span>,
         <span style="color: #50a14f;">"&#26368;&#36817;"</span>,
         <span style="color: #50a14f;">"&#29233;&#19978;&#20102;"</span>,
         <span style="color: #50a14f;">"&#20320;&#30340;&#38394;&#23494;"</span><span style="color: #4078f2;">)</span> == <span style="color: #50a14f;">"&#25105;&#26368;&#29233;&#20320;"</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc318596" class="outline-5">
<h5 id="orgc318596">完整代码</h5>
<div class="outline-text-5" id="text-orgc318596">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a626a4;">headPoem</span><span style="color: #4078f2;">(</span>sentences<span style="color: #383a42; background-color: #fafafa;">::</span><span style="color: #986801;">Vararg</span><span style="color: #a626a4;">{</span><span style="color: #986801;">String</span><span style="color: #a626a4;">}</span><span style="color: #4078f2;">)</span> =  map<span style="color: #4078f2;">(</span>first, sentences<span style="color: #4078f2;">)</span> |&gt; chs -&gt; reduce<span style="color: #4078f2;">(</span>string, chs; init=<span style="color: #50a14f;">""</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<p>
这里我用函数式的 <code>Clojure</code> 再写一遍吧<br />
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #4078f2;">(</span><span style="color: #e45649; font-weight: bold;">defn</span> <span style="color: #a626a4;">head-poem</span> <span style="color: #a626a4;">[</span>&amp; sentences<span style="color: #a626a4;">]</span>
  <span style="color: #a626a4;">(</span>reduce str <span style="color: #50a14f;">""</span> 
          <span style="color: #50a14f;">(</span>map first sentences<span style="color: #50a14f;">)</span><span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org17150ee" class="outline-5">
<h5 id="org17150ee">测试案例</h5>
<div class="outline-text-5" id="text-org17150ee">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #4078f2; font-weight: bold;">@test</span> headPoem<span style="color: #4078f2;">(</span><span style="color: #50a14f;">"&#25105;"</span>,
               <span style="color: #50a14f;">"&#26368;&#36817;"</span>,
               <span style="color: #50a14f;">"&#29233;&#19978;&#20102;"</span>,
               <span style="color: #50a14f;">"&#20320;&#30340;&#38394;&#23494;"</span><span style="color: #4078f2;">)</span> == <span style="color: #50a14f;">"&#25105;&#26368;&#29233;&#20320;"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3b47752" class="outline-4">
<h4 id="org3b47752">A5 括号匹配的检验</h4>
<div class="outline-text-4" id="text-org3b47752">
</div>
<div id="outline-container-orgec39167" class="outline-5">
<h5 id="orgec39167">题目描述</h5>
<div class="outline-text-5" id="text-orgec39167">
<p>
输入圆括号和方括号的任意序列，输出 <b>匹配</b> 或 <b>此串括号匹配不合法</b><br />
</p>
</div>
</div>
<div id="outline-container-org9ca52b9" class="outline-5">
<h5 id="org9ca52b9">题目分析</h5>
<div class="outline-text-5" id="text-org9ca52b9">
<p>
这个其实挺简单<br />
将左括号，左中括号一类的符号归为 <b>left</b> 类，将对应的符号归为 <b>right</b> 类<br />
遍历每一个符号<br />
</p>
<ul class="org-ul">
<li>每碰到 <code>left</code> 类符号，就把符号放到一个栈里<br /></li>
<li>每碰到 <code>right</code> 类符号，取栈顶 <code>top</code><br />
<ul class="org-ul">
<li>若 <code>right</code> 与 <code>top</code> 字符相对应，如 <code>(</code> 与 <code>)</code> ， <code>[</code> 与 <code>]</code> ，则出栈，进行下一次遍历<br /></li>
<li>若 <code>right</code> 与 <code>top</code> 字符不匹配，肯定不匹配，推出遍历<br /></li>
</ul></li>
<li>遍历结束后, <b>return</b> 栈是否为空栈<br /></li>
<li>注意，遍历前先把第一个符号入栈，否则无法处理 <code>"]"</code> 这种开头是 <b>right</b> 类符号的情况<br /></li>
</ul>
</div>
<div id="outline-container-orgf0c8e05" class="outline-6">
<h6 id="orgf0c8e05">函数定义</h6>
<div class="outline-text-6" id="text-orgf0c8e05">
<p>
<code>matchPatterns(code::String)</code><br />
</p>
<ul class="org-ul">
<li>输入字符串序列，只有圆括号和方括号<br /></li>
<li>输出括号是否匹配<br /></li>
</ul>
</div>
</div>
