html/Lab.html
<div id="outline-container-org6f780d7" class="outline-6">
<h6 id="org6f780d7">测试案例</h6>
<div class="outline-text-6" id="text-org6f780d7">
<ul class="org-ul">
<li><code>matchPatterns("([])()") =</code> true=<br /></li>
<li><code>matchPatterns("]") =</code> false=<br /></li>
<li><code>matchPatterns("]()") =</code> false=<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5e5e510" class="outline-5">
<h5 id="org5e5e510">完整代码</h5>
<div class="outline-text-5" id="text-org5e5e510">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #e45649; font-weight: bold;">function</span> <span style="color: #a626a4;">matchPatterns</span><span style="color: #4078f2;">(</span>code<span style="color: #383a42; background-color: #fafafa;">::</span><span style="color: #986801;">String</span><span style="color: #4078f2;">)</span>
  stack = createStack<span style="color: #4078f2;">(</span><span style="color: #986801;">Char</span><span style="color: #4078f2;">)</span>
  <span style="color: #a626a4;">isleft</span><span style="color: #4078f2;">(</span>ch<span style="color: #383a42; background-color: #fafafa;">::</span><span style="color: #986801;">Char</span><span style="color: #4078f2;">)</span> = ch == <span style="color: #50a14f;">'['</span> || ch == <span style="color: #50a14f;">'('</span>
  <span style="color: #a626a4;">isright</span><span style="color: #4078f2;">(</span>ch<span style="color: #383a42; background-color: #fafafa;">::</span><span style="color: #986801;">Char</span><span style="color: #4078f2;">)</span> = ch == <span style="color: #50a14f;">']'</span> || ch == <span style="color: #50a14f;">')'</span>
  <span style="color: #a626a4;">ismatch</span><span style="color: #4078f2;">(</span>left<span style="color: #383a42; background-color: #fafafa;">::</span><span style="color: #986801;">Char</span>, right<span style="color: #383a42; background-color: #fafafa;">::</span><span style="color: #986801;">Char</span><span style="color: #4078f2;">)</span> = <span style="color: #e45649; font-weight: bold;">begin</span>
    left == <span style="color: #50a14f;">'['</span> &amp;&amp; right == <span style="color: #50a14f;">']'</span> || 
      left == <span style="color: #50a14f;">'('</span> &amp;&amp; right == <span style="color: #50a14f;">')'</span>
  <span style="color: #e45649; font-weight: bold;">end</span>

  push!<span style="color: #4078f2;">(</span>stack, first<span style="color: #a626a4;">(</span>code<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>

  <span style="color: #e45649; font-weight: bold;">for</span> ch <span style="color: #e45649; font-weight: bold;">in</span> code<span style="color: #4078f2;">[</span>2:<span style="color: #e45649; font-weight: bold;">end</span><span style="color: #4078f2;">]</span>
    <span style="color: #e45649; font-weight: bold;">if</span> isleft<span style="color: #4078f2;">(</span>ch<span style="color: #4078f2;">)</span>
      push!<span style="color: #4078f2;">(</span>stack, ch<span style="color: #4078f2;">)</span>
    <span style="color: #e45649; font-weight: bold;">else</span>
      <span style="color: #e45649; font-weight: bold;">if</span> ismatch<span style="color: #4078f2;">(</span>first<span style="color: #a626a4;">(</span>stack<span style="color: #a626a4;">)</span>, ch<span style="color: #4078f2;">)</span>
        pop!<span style="color: #4078f2;">(</span>stack<span style="color: #4078f2;">)</span>
      <span style="color: #e45649; font-weight: bold;">else</span>
        <span style="color: #e45649; font-weight: bold;">break</span>
      <span style="color: #e45649; font-weight: bold;">end</span>
    <span style="color: #e45649; font-weight: bold;">end</span>
  <span style="color: #e45649; font-weight: bold;">end</span>

  <span style="color: #e45649; font-weight: bold;">return</span> isempty<span style="color: #4078f2;">(</span>stack<span style="color: #4078f2;">)</span>
<span style="color: #e45649; font-weight: bold;">end</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orga4534bc" class="outline-5">
<h5 id="orga4534bc">测试案例</h5>
<div class="outline-text-5" id="text-orga4534bc">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #4078f2; font-weight: bold;">@test</span> matchPatterns<span style="color: #4078f2;">(</span><span style="color: #50a14f;">"([])()"</span><span style="color: #4078f2;">)</span> == <span style="color: #b751b6;">true</span>
<span style="color: #4078f2; font-weight: bold;">@test</span> matchPatterns<span style="color: #4078f2;">(</span><span style="color: #50a14f;">"]"</span><span style="color: #4078f2;">)</span> == <span style="color: #b751b6;">false</span>
<span style="color: #4078f2; font-weight: bold;">@test</span> matchPatterns<span style="color: #4078f2;">(</span><span style="color: #50a14f;">"]()"</span><span style="color: #4078f2;">)</span> == <span style="color: #b751b6;">false</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org6283224" class="outline-3">
<h3 id="org6283224">10.1.3 二叉树与树</h3>
<div class="outline-text-3" id="text-org6283224">
<ul class="org-ul">
<li>我已提前实现了二叉树的遍历方法<br /></li>
<li>题目过于简单，就不用分析了吧<br /></li>
</ul>
</div>
<div id="outline-container-org978bfb3" class="outline-4">
<h4 id="org978bfb3">1. 二叉树各节点数值的平均值</h4>
<div class="outline-text-4" id="text-org978bfb3">
</div>
<div id="outline-container-org50ccefc" class="outline-5">
<h5 id="org50ccefc">函数说明</h5>
<div class="outline-text-5" id="text-org50ccefc">
<p>
<code>average(tree::BinarySearchTree)</code><br />
</p>
<ul class="org-ul">
<li>输入一个二叉树<br /></li>
<li>返回各节点数值的平均值<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org8ef4dfd" class="outline-5">
<h5 id="org8ef4dfd">测试案例</h5>
<div class="outline-text-5" id="text-org8ef4dfd">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #4078f2; font-weight: bold;">@test</span> average<span style="color: #4078f2;">(</span>tree<span style="color: #4078f2;">)</span> == reduce<span style="color: #4078f2;">(</span>+, collect<span style="color: #a626a4;">(</span>tree<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span> / length<span style="color: #4078f2;">(</span>tree<span style="color: #4078f2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb16593d" class="outline-5">
<h5 id="orgb16593d">完整代码</h5>
<div class="outline-text-5" id="text-orgb16593d">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #e45649; font-weight: bold;">function</span> <span style="color: #a626a4;">average</span><span style="color: #4078f2;">(</span>tree<span style="color: #383a42; background-color: #fafafa;">::</span><span style="color: #986801;">BinarySearchTree</span><span style="color: #4078f2;">)</span>
  len = length<span style="color: #4078f2;">(</span>tree<span style="color: #4078f2;">)</span>
  sum = reduce<span style="color: #4078f2;">(</span>+, collect<span style="color: #a626a4;">(</span>tree<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
  <span style="color: #e45649; font-weight: bold;">return</span> sum / len
<span style="color: #e45649; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org67262e7" class="outline-4">
<h4 id="org67262e7">2. 交换每个节点的左右节点</h4>
<div class="outline-text-4" id="text-org67262e7">
</div>
<div id="outline-container-org3025619" class="outline-5">
<h5 id="org3025619">函数说明</h5>
<div class="outline-text-5" id="text-org3025619">
<div class="org-src-container">
<pre class="src src-julia">swapnode!<span style="color: #4078f2;">(</span>tree<span style="color: #383a42; background-color: #fafafa;">::</span><span style="color: #986801;">BinarySearchTree</span><span style="color: #4078f2;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>输入一个二叉树<br /></li>
<li>将其中每个节点的左右节点交换<br /></li>
<li>没有返回值<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org64d4421" class="outline-5">
<h5 id="org64d4421">测试案例</h5>
<div class="outline-text-5" id="text-org64d4421">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #4078f2; font-weight: bold;">@testset</span> <span style="color: #50a14f;">"practise 2"</span> <span style="color: #e45649; font-weight: bold;">begin</span>
  swapnode!<span style="color: #4078f2;">(</span>tree<span style="color: #4078f2;">)</span>
  <span style="color: #4078f2; font-weight: bold;">@info</span> <span style="color: #50a14f;">"after swap the tree is "</span> tree
<span style="color: #e45649; font-weight: bold;">end</span>
</pre>
</div>

<p>
由于代码中向 <code>tree</code> 插入的数据都是随机的，测试结果不好展示<br />
其实我懒得展示<br />
</p>
</div>
</div>
<div id="outline-container-orgf1580ff" class="outline-5">
<h5 id="orgf1580ff">完整代码</h5>
<div class="outline-text-5" id="text-orgf1580ff">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #e45649; font-weight: bold;">function</span> <span style="color: #a626a4;">swapnode!</span><span style="color: #4078f2;">(</span>tree<span style="color: #383a42; background-color: #fafafa;">::</span><span style="color: #986801;">BinarySearchTree</span><span style="color: #4078f2;">)</span>
  <span style="color: #a626a4;">swap</span><span style="color: #4078f2;">(</span>node<span style="color: #383a42; background-color: #fafafa;">::</span><span style="color: #986801;">BinaryNode</span><span style="color: #4078f2;">)</span> = <span style="color: #e45649; font-weight: bold;">begin</span>
    temp = left<span style="color: #4078f2;">(</span>node<span style="color: #4078f2;">)</span>
    node.left = node.right
    node.right = temp
  <span style="color: #e45649; font-weight: bold;">end</span>

  <span style="color: #e45649; font-weight: bold;">for</span> treenode <span style="color: #e45649; font-weight: bold;">in</span> bfsiterate<span style="color: #4078f2;">(</span>tree<span style="color: #4078f2;">)</span>
    swap<span style="color: #4078f2;">(</span>treenode<span style="color: #4078f2;">)</span>
  <span style="color: #e45649; font-weight: bold;">end</span>
<span style="color: #e45649; font-weight: bold;">end</span>
</pre>
</div>

<p>
程序从 <code>bfsiterate</code> 返回的迭代器中取出节点 <code>treenode</code><br />
</p>
</div>
</div>
</div>
<div id="outline-container-org150b25a" class="outline-4">
<h4 id="org150b25a">3. 验证 二叉树性质3</h4>
<div class="outline-text-4" id="text-org150b25a">
</div>
<div id="outline-container-orgd98e4d8" class="outline-5">
<h5 id="orgd98e4d8">函数说明</h5>
<div class="outline-text-5" id="text-orgd98e4d8">
<p>
<code>verify(tree::BinarySearchTree)</code><br />
</p>
<ul class="org-ul">
<li>输入一个二叉树<br /></li>
<li>输出 <code>true</code> 或者 <code>false</code> <br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgcb09441" class="outline-5">
<h5 id="orgcb09441">测试案例</h5>
<div class="outline-text-5" id="text-orgcb09441">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #4078f2; font-weight: bold;">@test</span> verify<span style="color: #4078f2;">(</span>tree<span style="color: #4078f2;">)</span> == <span style="color: #b751b6;">true</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8586006" class="outline-5">
<h5 id="org8586006">完整代码</h5>
<div class="outline-text-5" id="text-org8586006">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #e45649; font-weight: bold;">function</span> <span style="color: #a626a4;">verify</span><span style="color: #4078f2;">(</span>tree<span style="color: #383a42; background-color: #fafafa;">::</span><span style="color: #986801;">BinarySearchTree</span><span style="color: #4078f2;">)</span>
  queue = createQueue<span style="color: #4078f2;">(</span>AbstractBinaryNode<span style="color: #4078f2;">)</span>
  push!<span style="color: #4078f2;">(</span>queue, tree.root<span style="color: #4078f2;">)</span>

  n0 = n2 = 0

  <span style="color: #e45649; font-weight: bold;">for</span> treenode <span style="color: #e45649; font-weight: bold;">in</span> bfsiterate<span style="color: #4078f2;">(</span>tree<span style="color: #4078f2;">)</span>
    <span style="color: #9ca0a4;"># </span><span style="color: #9ca0a4;">here process the node</span>
    <span style="color: #e45649; font-weight: bold;">if</span> isleaf<span style="color: #4078f2;">(</span>treenode<span style="color: #4078f2;">)</span>
      n0 += 1
    <span style="color: #e45649; font-weight: bold;">elseif</span> !isnil<span style="color: #4078f2;">(</span>left<span style="color: #a626a4;">(</span>treenode<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span> &amp;&amp; !isnil<span style="color: #4078f2;">(</span>right<span style="color: #a626a4;">(</span>treenode<span style="color: #a626a4;">)</span><span style="color: #4078f2;">)</span>
      n2 += 1
    <span style="color: #e45649; font-weight: bold;">end</span>
  <span style="color: #e45649; font-weight: bold;">end</span>

  <span style="color: #e45649; font-weight: bold;">return</span> n0 == n2 + 1
<span style="color: #e45649; font-weight: bold;">end</span>
</pre>
</div>
</div>
</div>
</div>
